tangyangguang/Esp32_Faucet/src/web/FaucetWeb.cpp
    WaterPulseTraceSample* samples = new (std::nothrow) WaterPulseTraceSample[trace->sampleCount]{};
    WaterPulseTraceBucket* buckets = new (std::nothrow) WaterPulseTraceBucket[trace->sampleCount]{};
    if (!samples || !buckets) {
        delete[] samples;
        delete[] buckets;
        Esp32BaseWeb::sendChunk("<p class='err'>内存不足，无法生成脉冲明细。</p>");
        sendPageEnd();
        return;
    }
    for (std::size_t i = 0; i < trace->sampleCount; ++i) {
        const WaterPulseTraceSample* sample = g_context.pulseTraces->sampleAt(*trace, i);
        samples[i] = sample ? *sample : WaterPulseTraceSample{};
    }
    const std::size_t bucketCount =
        aggregateWaterPulseTrace(*trace, samples, trace->sampleCount, bucketSeconds, buckets, trace->sampleCount);
    const WaterPulseTraceAnalysis analysis = analyzeWaterPulseTrace(*trace, samples, trace->sampleCount);

    char startTime[40]{};
    formatWaterRecordTime(trace->record, startTime, sizeof(startTime));
    const std::size_t traceBytes = sizeof(WaterPulseTrace) + trace->sampleCount * sizeof(WaterPulseTraceSample);
    char traceKb[24]{};
    formatKb(traceBytes, traceKb, sizeof(traceKb));
    Esp32BaseWeb::sendChunk("<h2>脉冲明细</h2><p><a class='btn-link' href='/faucet/records'>返回记录</a></p>");
    Esp32BaseWeb::sendChunk("<section class='panel'><h3>明细概况</h3><table class='kv'>");
    sendFmt("<tr><th>开始时间</th><td>%s</td></tr>"
            "<tr><th>目标</th><td>",
            startTime);
    sendTargetValue(trace->record);
    Esp32BaseWeb::sendChunk("</td></tr><tr><th>固件估算</th><td>");
    sendLiters(trace->record.volumeMl);
    sendFmt("</td></tr><tr><th>总脉冲</th><td>%lu</td></tr>"
            "<tr><th>持续时间</th><td>%lu s</td></tr>"
            "<tr><th>样本数</th><td>%lu</td></tr>"
            "<tr><th>本条占用</th><td>%s</td></tr>",
            static_cast<unsigned long>(trace->totalPulses),
            static_cast<unsigned long>(trace->sampleCount),
            static_cast<unsigned long>(trace->sampleCount),
            traceKb);
    if (analysis.stable) {
        sendFmt("<tr><th>稳态开始</th><td>第 %lu 秒，启动段 %lu 脉冲，稳态 %.2f P/s，置信度 %u%%</td></tr>",
                static_cast<unsigned long>(analysis.stableStartSec),
                static_cast<unsigned long>(analysis.startupPulseCount),
                static_cast<double>(analysis.stablePulsePerSec),
                static_cast<unsigned>(analysis.confidence));
    } else {
        Esp32BaseWeb::sendChunk("<tr><th>稳态识别</th><td>无法识别</td></tr>");
    }
    Esp32BaseWeb::sendChunk("</table></section>");

    Esp32BaseWeb::sendChunk("<section class='panel'><div class='panel-head'><h3>聚合频率</h3><div class='row-actions'>");
    constexpr std::uint32_t bucketsToShow[] = {1, 2, 3, 5};
    for (std::uint32_t bucket : bucketsToShow) {
        sendFmt("<a class='btn-link' href='/faucet/records/detail?trace=%lu&bucket=%lu'>%lus</a>",
                static_cast<unsigned long>(traceId),
                static_cast<unsigned long>(bucket),
                static_cast<unsigned long>(bucket));
    }
    std::uint32_t maxDelta = 1;
    std::uint32_t maxCumulative = 1;
    for (std::size_t i = 0; i < bucketCount; ++i) {
        maxDelta = std::max(maxDelta, buckets[i].pulseDelta);
        maxCumulative = std::max(maxCumulative, buckets[i].cumulativePulses);
    }
    const std::uint32_t left = 54;
    const std::uint32_t top = 28;
    const std::uint32_t baseY = 224;
    const std::uint32_t chartHeight = 176;
    const std::uint32_t chartWidth = 900;
    const std::uint32_t maxEndSec =
        bucketCount == 0 ? 1 : std::max<std::uint32_t>(1, buckets[bucketCount - 1].startSec + buckets[bucketCount - 1].durationSec);
    Esp32BaseWeb::sendChunk("</div></div><div class='pulse-detail-chart'><svg viewBox='0 0 1000 300' role='img' aria-label='脉冲明细折线图'>"
                            "<line class='axis' x1='54' y1='224' x2='954' y2='224'></line>"
                            "<line class='axis' x1='54' y1='28' x2='54' y2='224'></line>");
    for (std::uint32_t i = 1; i <= 4; ++i) {
        const std::uint32_t y = baseY - (chartHeight * i) / 4;
        sendFmt("<line class='grid-line' x1='54' y1='%lu' x2='954' y2='%lu'></line>",
                static_cast<unsigned long>(y),
                static_cast<unsigned long>(y));
    }
    sendFmt("<text class='chart-label' x='54' y='248'>0s</text>"
            "<text class='chart-label' x='918' y='248'>%lus</text>"
            "<text class='chart-label' x='58' y='20'>每桶最高 %luP / 累计 %luP</text>",
            static_cast<unsigned long>(maxEndSec),
            static_cast<unsigned long>(maxDelta),
            static_cast<unsigned long>(maxCumulative));
    Esp32BaseWeb::sendChunk("<polyline class='pulse-line' points='");
    sendFmt("%lu,%lu", static_cast<unsigned long>(left), static_cast<unsigned long>(baseY));
    for (std::size_t i = 0; i < bucketCount; ++i) {
        const std::uint32_t endSec = buckets[i].startSec + buckets[i].durationSec;
        const std::uint32_t x = left + (endSec * chartWidth) / maxEndSec;
        const std::uint32_t y = baseY - (buckets[i].pulseDelta * chartHeight) / maxDelta;
        sendFmt(" %lu,%lu", static_cast<unsigned long>(x), static_cast<unsigned long>(y));
    }
    Esp32BaseWeb::sendChunk("'></polyline><polyline class='cum-line' points='");
    sendFmt("%lu,%lu", static_cast<unsigned long>(left), static_cast<unsigned long>(baseY));
    for (std::size_t i = 0; i < bucketCount; ++i) {
        const std::uint32_t endSec = buckets[i].startSec + buckets[i].durationSec;
        const std::uint32_t x = left + (endSec * chartWidth) / maxEndSec;
        const std::uint32_t y = baseY - (buckets[i].cumulativePulses * chartHeight) / maxCumulative;
        sendFmt(" %lu,%lu", static_cast<unsigned long>(x), static_cast<unsigned long>(y));
    }
    Esp32BaseWeb::sendChunk("'></polyline>");
    if (analysis.stable) {
        const std::uint32_t stableX = left + (analysis.stableStartSec * chartWidth) / maxEndSec;
        sendFmt("<line class='stable-line' x1='%lu' y1='%lu' x2='%lu' y2='%lu'></line>"
                "<text class='chart-label' x='%lu' y='42'>稳态 %lus</text>",
                static_cast<unsigned long>(stableX),
                static_cast<unsigned long>(top),
                static_cast<unsigned long>(stableX),
                static_cast<unsigned long>(baseY),
                static_cast<unsigned long>(stableX + 6),
                static_cast<unsigned long>(analysis.stableStartSec));
    }
    for (std::size_t i = 0; i < bucketCount; ++i) {
        const std::uint32_t endSec = buckets[i].startSec + buckets[i].durationSec;
        const std::uint32_t x = left + (endSec * chartWidth) / maxEndSec;
        const std::uint32_t y = baseY - (buckets[i].pulseDelta * chartHeight) / maxDelta;
        sendFmt("<circle class='pulse-dot' cx='%lu' cy='%lu' r='2.6'><title>%lu-%lus: %luP / 累计 %luP / %s</title></circle>",
                static_cast<unsigned long>(x),
                static_cast<unsigned long>(y),
                static_cast<unsigned long>(buckets[i].startSec),
                static_cast<unsigned long>(endSec),
                static_cast<unsigned long>(buckets[i].pulseDelta),
                static_cast<unsigned long>(buckets[i].cumulativePulses),
                traceStateText(buckets[i].state));
    }
    Esp32BaseWeb::sendChunk("</svg></div><div class='chart-legend'>"
                            "<span><i class='legend-mark legend-pulse'></i>每桶脉冲</span>"
                            "<span><i class='legend-mark legend-cum'></i>累计脉冲</span>"
                            "<span><i class='legend-mark legend-stable'></i>稳态开始</span>"
                            "</div></section><details class='panel detail-data'><summary>查看明细数据</summary>"
                            "<table><tr><th>时间</th><th>脉冲</th><th>累计</th><th>状态</th></tr>");
    for (std::size_t i = 0; i < bucketCount; ++i) {
        sendFmt("<tr><td>%lu-%lus</td><td>%luP</td><td>%luP</td><td>%s</td></tr>",
                static_cast<unsigned long>(buckets[i].startSec),
                static_cast<unsigned long>(buckets[i].startSec + buckets[i].durationSec),
                static_cast<unsigned long>(buckets[i].pulseDelta),
                static_cast<unsigned long>(buckets[i].cumulativePulses),
                traceStateText(buckets[i].state));
    }
    Esp32BaseWeb::sendChunk("</table></details>");

